HELLO_MESSAGE = \
    'Доброго времени суток, напишите название города,' \
    ' о погоде в котором хотите узнать.\n' \
    'Для получения информации о дополнительных функциях - /help'

HELP_MESSAGE =\
    'Доступные возможности:\n' \
    '/my_schedule - узнать ваше расписание уведомлений о погоде\n' \
    '/new_schedule - добавить уведомление о погоде\n' \
    '/del_schedule - удалить уведомление о погоде\n' \
    '/change_default_cities - изменить кнопки стандартных городов\n' \
    'пока все'

BAN_MESSAGE = \
    'Вы слишком часто пытались получить доступ к сервису и' \
    ' получили временную блокировку.'

SUCCESS_MESSAGE = \
    'Отлично, все получилось!'

CHANGE_FIRST_CITY_MESSAGE = \
    'Введите название города, на который вы хотите ' \
    'заменить значение ПЕРВОЙ кнопки.'

CHANGE_SECOND_CITY_MESSAGE = \
    'Введите название города, на который вы хотите ' \
    'заменить значение ВТОРОЙ кнопки.'

SHARE_MESSAGE = \
    'Рассказать о погоде.'

ADDING_TIME_SCHEDULE_MESSAGE = \
    'Во сколько вы хотите получать уведомления?\n' \
    '(Напишите в формате xx.xx по московскому часовому поясу)\n' \
    '(Или введите "Отмена", если хотите прервать действие)'

ADDING_CITY_SCHEDULE_MESSAGE = \
    'О каком городе вы хотите получать уведомления?\n'


DEL_SCHEDULE_TIME_MESSAGE = \
    'Во сколько вы не хотите получать уведомления об этом городе?\n' \
    '(Напишите в формате xx.xx по московскому часовому поясу)\n' \
    '(Или введите "Отмена", если хотите прервать действие)'

DEL_SCHEDULE_CITY_MESSAGE = \
    'О каком городе вы не хотите получать уведомления?\n'

NO_CITY_DEL_SCHEDULE_MESSAGE = \
    'Вы не получаете уведомлений об этом городе.' \
    'Попробуйте еще раз.\n' \
    '(Или введите "Отмена", если хотите прервать действие)'

ERROR_ENTERING_MESSAGE = \
    'Вы ввели что то неправильно, попробуйте еще!\n' \
    '(Или введите "Отмена", если хотите прервать действие)'

N0_SCHEDULE_VALUE_MESSAGE = \
    'У вас нет уведомлений об этом гоороде в это время.\n' \
    'Попробуйте ввести время еще раз.\n' \
    '(Или введите "Отмена", если хотите прервать действие)'

NO_SCHEDULE_MESSAGE = \
    'Пока вы не добавили уведомления.\n' \
    'Воспользуйтесь /new_schedule для их создания.'

SCHEDULE_ALREADY_EXIST = \
    'Уведомление с этими параметрами, уже существует!'

